# ----------------------------------------------------------------
# Кнопки админ-меню
# ----------------------------------------------------------------
BROADCAST_BUTTON = "👥 Рассылка"
GIVE_MINUTES_BUTTON = "➕ Выдать минуты"
GIVE_VIDEOS_BUTTON = "➕ Выдать видео"
FREE_VIDEO_BUTTON = "🎁 Бесплатное видео"
BLOCK_BUTTON = "🔒 Заблокировать"
UNBLOCK_BUTTON = "🔓 Разблокировать"
COUNT_USERS_BUTTON = "👥 Кол-во пользователей"
STATS_TODAY_BUTTON = "📊 Статистика (сегодня)"


# ----------------------------------------------------------------
# Кнопки для main.py
# ----------------------------------------------------------------
SEND_VIDEO_BTN = "🎬 Перевести видео"
MY_ACCOUNT_BTN = "👤 Мой аккаунт"
SUPPORT_BTN = "🆘 Поддержка"
ABOUT_BTN = "ℹ️ О боте"
PARTNERS_BTN = "🤝 Партнерам"
ADMIN_MENU_BTN = "🛠 Админ-меню"

MINUTE_1_BTN = "1 минута"
MINUTE_5_BTN = "5 минут"
MINUTE_30_BTN = "30 минут"
MINUTE_60_BTN = "60 минут"
MINUTE_CUSTOM_BTN = "⏱️ Ввести своё"

VIDEO_1_BTN = "1 видео"
VIDEO_5_BTN = "5 видео"
VIDEO_10_BTN = "10 видео"
VIDEO_20_BTN = "20 видео"
VIDEO_CUSTOM_BTN = "📹 Ввести своё"

BTN_BACK_TO_ACCOUNT = "⬅️ Назад"
BTN_PAY_METHOD = "💰 Перейти к оплате"


# ----------------------------------------------------------------
# Кнопки для payment.py
# ----------------------------------------------------------------
PAY_CARD_BTN = "💳 Перевод по карте"
PAY_CRYPTO_BTN = "💎 CryptoBot"
PAY_STARS_BTN = "⭐ Telegram Stars"

# BTN_BACK_TO_ACCOUNT = "⬅️ Назад"

BTN_USER_PAID = "✅ Я оплатил"
BTN_CONFIRM = "✅ Подтвердить"
BTN_REJECT = "❌ Отклонить"
BTN_PAY_NOW = "💰 Оплатить"
BTN_OTHER_CURRENCIES = "🌐 Другие..."
